app/views/assignments/index.html.erb

        <td><%= assignment.pay_grade.level %> </td>
        <td><%= assignment.shifts.length %> </td>
---
SELECT "shifts".* FROM "shifts" WHERE "shifts"."assignment_id" = ?  [["assignment_id", 2]]