app/controllers/api/v1/shifts_controller.rb

    def upcoming
      @shift = Shift.for_next_days(7).select{
---
SELECT "shifts".* FROM "shifts" WHERE (date BETWEEN '2023-03-30' AND '2023-04-06')

    def set_shift
      @shift = Shift.find(params[:id])
---
SELECT "shifts".* FROM "shifts" WHERE "shifts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]