app/controllers/application_controller.rb

  def current_user
    @current_user ||= Employee.find(session[:employee_id]) if session[:employee_id]
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]