app/controllers/assignments_controller.rb

SELECT "assignments".* FROM "assignments" WHERE (end_date IS NULL)
---
        def set_assignment
            @assignment = Assignment.find(params[:id])