app/controllers/shifts_controller.rb

    def set_shifts
        @shift = Shift.find(params[:id])
---
SELECT "shifts".* FROM "shifts" WHERE (date >= '2023-04-19')