app/serializers/api/v1/employee_serializer.rb

    end

    attribute :recent_shifts do |employee|
      employee.shifts.for_past_days(7).map do |shift|
---
SELECT "shifts".* FROM "shifts" INNER JOIN "assignments" ON "shifts"."assignment_id" = "assignments"."id" WHERE "assignments"."employee_id" = ? AND (date BETWEEN '2023-03-23' AND '2023-03-29')  [["employee_id", 2]]